-- phpMyAdmin SQL Dump
-- version 4.5.4.1deb2ubuntu2.1
-- http://www.phpmyadmin.net
--
-- 主機: 172.31.21.10:3306
-- 產生時間： 2020 年 04 月 05 日 12:41
-- 伺服器版本: 5.7.22-log
-- PHP 版本： 7.0.33-26+ubuntu16.04.1+deb.sury.org+1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `interview_test`
--

-- --------------------------------------------------------

--
-- 資料表結構 `constellation_fortunes`
--

CREATE TABLE `constellation_fortunes` (
  `id` int(10) UNSIGNED NOT NULL,
  `date` date NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `overall_fortune` tinyint(4) NOT NULL COMMENT '整體運勢評分',
  `overall_description` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '整體運勢說明',
  `love_fortune` tinyint(4) NOT NULL COMMENT '愛情運勢評分',
  `love_description` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '愛情運勢說明',
  `business_fortune` tinyint(4) NOT NULL COMMENT '事業運勢評分',
  `business_description` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '事業運勢說明',
  `wealth_fortune` tinyint(4) NOT NULL COMMENT '財運運勢評分',
  `wealth_description` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '財運運勢說明',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 資料表的匯出資料 `constellation_fortunes`
--

INSERT INTO `constellation_fortunes` (`id`, `date`, `name`, `overall_fortune`, `overall_description`, `love_fortune`, `love_description`, `business_fortune`, `business_description`, `wealth_fortune`, `wealth_description`, `created_at`, `updated_at`) VALUES
(1, '2020-04-04', '牡羊座', 4, '單身者會有種不是冤家不聚頭的感覺，不論本人是男是女，女孩的淚水都會成為單身者獲得愛情的催化劑；財運良好，你會小有成就感，財富有累積的跡象出現哦！得到與付出難成正比，耐心些才有突破。', 4, '期望對方為自己做些改變，要找個有智慧的方式傳達給對方知道，說話別太直喔！', 4, '頭腦靈活、創意多的一天，多多運用於感興趣的事物中，容易有很好的表現唷！', 3, '做小生意者，可賺取更多意外之財。', '2020-04-03 17:00:04', '2020-04-03 17:00:04'),
(2, '2020-04-04', '金牛座', 4, '愛情運看好，之前新結識的異性，今天可望有進一步發展；諸多事宜可交付信賴之人去辦，將減輕你不少負擔；拿出一部分資金捐助慈善機構，幫助那些需要幫助的人，你必有福報。', 4, '全心投入到工作中，容易忽略另一半的感受，抽時間多陪陪伴侶也是今天的功課。', 4, '健康狀況良好，能滿懷自信和活力來應對各種事務。', 3, '若能多親近長輩，會有不錯的進財機會。', '2020-04-03 17:00:06', '2020-04-03 17:00:06'),
(3, '2020-04-04', '雙子座', 3, '苦心經營的感情有破裂的危險，還好最終理智戰勝衝動，矛盾也有機會得以化解。財運普通，邀幾個牌友切磋牌技，會有不錯的收穫；學習熱忱漸濃，幹勁十足，再加上不錯的貴人緣，學習效率也會有明顯提高。', 2, '愛情能平穩發展。雖然偶爾會有一些爭執和小爭吵，但對你倆的戀情不會有太大影響。', 4, '有機會接觸新事務，讓你大開眼界。倘若積極策劃，可望有好的表現。', 3, '另闢財路頗為不順，穩守現有領域為要務，免得兩頭受阻。', '2020-04-03 17:00:08', '2020-04-03 17:00:08'),
(4, '2020-04-04', '巨蟹座', 3, '不管再忙，也要記得和家人的約定，聊聊家常會讓整個人精神抖擻呢；就算平日對抽獎、樂透不感興趣，偏財運好的今天也不妨去試試，會有不小的收穫；愛情上進展不順，多向朋友問問意見，旁觀者會比你看得更清楚。', 2, '單身者有機會在親友的撮合下結識異性朋友，倘若談得投機，不妨慢慢培養感情。', 3, '有朋友向你訴說心事，而且你的開導令對方感到心情愉悅，讓你很有成就感。', 4, '有中小獎的機會。', '2020-04-03 17:00:10', '2020-04-03 17:00:10'),
(5, '2020-04-04', '獅子座', 3, '遭遇自己無法解決的困難時不要羞於啟齒，只要你願意開口請求幫助，會有人願意伸出援助之手；投資方向有點混亂，需他人的指點才能找到突破口；複習功課有點找不到頭緒，稍做休息，先把思路理清，才能更好的繼續手頭上的事情。', 3, '內心充滿了熱情，希望得到另一半的關愛，但你一臉的冷漠，讓對方不知所措。', 3, '運勢平順，適合總結過去，展望未來。別急著往前衝，給自己一些冷靜思考的時間。', 2, '在購物時容易買到瑕疵品，最後搞得自己心情一團糟。', '2020-04-03 17:00:13', '2020-04-03 17:00:13'),
(6, '2020-04-04', '處女座', 3, '開朗活潑的一面突顯，受到眾人的歡迎，加入群體中，能與不同領域的人交談甚歡。交朋友無所謂，但與異性之間還是要保持距離，小心惹來爛桃花。', 3, '已婚者可以與另一半共同做些家務事，增進感情；單身者可自娛自樂，驅走孤獨感。', 2, '受點小小的打擊會讓你更有動力，咬緊牙關堅持住了，好運也就隨之降臨了呢！', 3, '錢財外借時要謹慎為上，比較大筆的借貸在不傷情分的情況下，最好先做足調查工作，以防受到詐騙。', '2020-04-03 17:00:15', '2020-04-03 17:00:15'),
(7, '2020-04-04', '天秤座', 3, '桃花來時，難免讓你有些得意，但猶豫不決又會錯過良緣哦；從事服務行業的人，憑藉和善的態度，會得到他人的讚揚；礙於面子，產生一筆不小的消費，事後又讓自己後悔不已。', 4, '桃花運強，會有機會與心儀的異性單獨交談，要好好把握這個千載難逢的機會。', 3, '忙碌的狀態，比較容易讓你產生成就感，而今天乃清閒之日，就會讓你有些無所適從。', 2, '不要放太多的現金在身邊，少點玩樂機會方可降低散財指數。', '2020-04-03 17:00:17', '2020-04-03 17:00:17'),
(8, '2020-04-04', '天蠍座', 4, '耐性不足，急躁中容易遺漏重要工作，用便條記錄工作要點並張貼在醒目處，以提醒自己；今日正財運、偏財運都很旺，股票投資者可趁著好運勢買進；晚上到熱鬧的PUB將不滿的情緒宣洩一番，會輕鬆不少。', 4, '單身者異性助力強；戀愛中的人可感受到浪漫與甜蜜；已婚者宜多陪陪另一半。', 3, '感慨萬千的一天，想一個人清靜一下，卻不得不參與到家庭成員的活動中。', 5, '穩定得財日，上班族沒有明顯的變化。對於業務洽商工作者好運的力量較強，只要積極的奔波，多與人接觸，不難創造好績效。', '2020-04-03 17:00:19', '2020-04-03 17:00:19'),
(9, '2020-04-04', '射手座', 5, '想要好好玩樂，但中途生變的機率高，如碰到空降任務、急需加班等，不過，你多能隨機應變，出色完成。今天對求職者特別有利，有機會被伯樂相中，獲得意料之外的好職位。愛情較平順，感覺安穩。', 4, '單身者易遇到令你心動的對象，會不顧一切地投入愛河；已婚者多抽時間陪陪另一半。', 5, '頭腦非常的清晰，多能做出正確的推理，瞬間掌握重點來做事，所以效率特別高。', 4, '競爭中得財，得財略為費心吃力，可是有付出必有所得。動口生財者較容易感受到今日的好運。', '2020-04-03 17:00:22', '2020-04-03 17:00:22'),
(10, '2020-04-04', '摩羯座', 5, '很適合與戀人約會，不論是攜手漫步，還是到遊樂場玩刺激的遊戲，都能感受到彼此濃烈的愛。胃口特別好，在吃喝玩樂中結識新朋友。今天對求職者特別有利，有機會在休閒中遇到伯樂。', 4, '已婚者與另一半的交流順暢，易感受到對方的愛意；戀愛中的人可規劃未來的兩人生活。', 5, '可推行預期計劃，易有不錯的效果。多利用人際關係，可大大減輕你的壓力！', 4, '財氣順順，得財不費力。有閒錢的人不妨在今日投資，容易有意外的收穫喔！', '2020-04-03 17:00:24', '2020-04-03 17:00:24'),
(11, '2020-04-04', '水瓶座', 3, '單身者有機會在朋友聚會中結識極具個性、眼光獨到的異性朋友，激情碰撞，讓你感受到愛情的火熱。雖然請客花掉一筆不小的錢財，但你的消息靈通，能從朋友不經意的言語中受到啟發，從中挖掘到商機。', 4, '單身者容易成為眾人矚目的對象，但真想戀愛還得耐心觀察，太快投入一段感情會後悔！', 3, '同事間關係良好，有機會獲得助力，但也容易因為對方的疏忽而讓你的名聲受損。', 4, '財運不錯，小部份的資金方可投入短線、高風險的範圍。', '2020-04-03 17:00:26', '2020-04-03 17:00:26'),
(12, '2020-04-04', '雙魚座', 4, '感受力很強的一天，特別能體會他人的內心感受，朋友也都願意找你聊心事，讓他人獲得安慰的同時，你也收獲到了助人的快樂。財運不錯，親友請客、收到禮物、中獎的機率高。', 3, '總是和另一半單獨約會讓你感覺有點悶，那就安排一兩次Party，大夥兒一塊熱鬧熱鬧吧！', 4, '有良好的語言表達能力，和人交流時，能夠順暢的表達出自己的想法。', 4, '金錢運作頻繁的一天，金錢流通快速，對於有錢人的影響較大，有大手筆投資的跡象。', '2020-04-03 17:00:28', '2020-04-03 17:00:28'),
(13, '2020-04-05', '牡羊座', 3, '今天容易受到流言蜚語的中傷，不要太在意，以免因別人的流言阻礙你前進的步伐；單身者今天會感到格外空虛，不能因此而放縱自己哦！財運較好，新的進財渠道讓你收入頗豐，富足的時候可以獻愛心給需要幫助的人。', 4, '單身者容易遇到讓你傾心的對象，倘若能好好珍惜，不難圓一段美好姻緣。', 2, '感受力強，對他人說的話較敏感，易傷感，對有些人、有些話不必太在意，以免操心煩神。', 4, '財運佳，有機會從異性朋友口中獲得商機。', '2020-04-04 16:00:08', '2020-04-04 16:00:08'),
(14, '2020-04-05', '金牛座', 3, '坐在辦公室的工作者切勿利用上班時間炒股，易被老闆發現，引起不良的影響；今天比較繁忙，與戀人沒有什麼獨處的時間，不過抽出點點時間打個電話給他，也會讓彼此心情不錯；多結交一些朋友，聚集更多的人脈，這也是一筆珍貴的財富。', 3, '桃花運旺盛，很容易引起異性為你爭風吃醋。如何處理好與異性間的關係是重點。', 3, '運勢不錯，創意十足，有機會在休息期間突發奇想，對拓展工作新領域很有助益！', 3, '股市急先鋒務必要見好就收，否則易有橫發橫破之災。', '2020-04-04 16:00:10', '2020-04-04 16:00:10'),
(15, '2020-04-05', '雙子座', 4, '全家人宜聚在一起吃頓飯，更不能忘了為健康、生活、運勢祈福；今天的偏財運還是不錯的，閒得無聊時可和家人朋友打打麻將，旺旺手氣；同居的情侶窩在家裡看看電視，也能在平淡中體會到與以往不一樣的家的味道。', 4, '適合約會，在彼此的溝通、交流中感情進展快速，戀愛中人不妨多安排相處的時間。', 3, '思慮周全、處事謹慎，不易犯錯誤，但行動力不足，卻容易讓你失去一些好機會。', 4, '偏財運雖不錯，但不可過分投機。', '2020-04-04 16:00:12', '2020-04-04 16:00:12'),
(16, '2020-04-05', '巨蟹座', 3, '今天你顯得很膽小，讓朋友對你頗為失望，無懼無畏才會有收穫；今天財運一般，購置不動產會讓你的財產升值空間更大；單身者今天可出去活動放鬆，會與好桃花不期而遇。', 4, '有機會遇到讓你心動的對象，別太拘謹，大膽地靠近對方，讓對方認識你，慢慢瞭解你吧。', 3, '事情有停滯不前的狀況，別一昧地埋頭苦幹，多想想問題出在什麼地方，對症下藥。', 2, '消費上盡量的控制，非必要性商品就少買點囉。', '2020-04-04 16:00:14', '2020-04-04 16:00:14'),
(17, '2020-04-05', '獅子座', 3, '今天要花很多心思討好戀人，腦細胞損失不少，但能獲得想要的效果，很值得；感情的投資是一筆不小的數目，但這種花費也沒白費，不要太心痛了；心情愉悅，讓你做起事來都感覺輕鬆許多。', 4, '已婚者和另一半在忙上忙下的同時，別忘了感謝對方陪你共同努力的辛勞唷！', 3, '運勢轉明，可藉機嘗試新的挑戰，改善並擴大人際交往，會有豐厚的回報。', 2, '複雜、高難度型的金錢遊戲不太適合在今天玩。', '2020-04-04 16:00:16', '2020-04-04 16:00:16'),
(18, '2020-04-05', '處女座', 4, '和戀人在一起，你表現得有些冷落，易讓對方產生一種被忽略的感覺，不利於你們感情的順利發展；得到他人的物質援助，讓你的經濟寬裕不少；在街上偶遇同事不妨打個招呼，你會發現對方生活中的另一面。', 3, '單身者表現得獨立自主，不刻意追求愛情；戀愛中的人表面堅強，但內心渴望對方的關心。', 5, '心情很好，良好的心境讓你做起事來特別有勁，只是注意處理不了的事不要蠻幹，找有經驗者幫忙處理為宜。', 4, '有一些意外之財，數目不是很大。', '2020-04-04 16:00:18', '2020-04-04 16:00:18'),
(19, '2020-04-05', '天秤座', 3, '沒有心事，喜歡享受獨處的快樂時光，但也容易把比較重要的事情忘記。早上應好好想想今天是什麼重要的日子，有什麼重要的事情要做，以免錯過。下午運勢強盛，多與老朋友聯繫，有機會獲得不錯的賺錢渠道。', 3, '夫妻之間聚少離多，分隔兩地的伴侶不妨多打電話或發E-mail表達愛意，感情會更加濃厚。', 2, '遇到麻煩別一個人冥思苦想，多與朋友交流，集思廣益，可望解決問題。', 4, '大財沒有，小財會有一點，讓你歡喜讓你憂。', '2020-04-04 16:00:20', '2020-04-04 16:00:20'),
(20, '2020-04-05', '天蠍座', 4, '如果一時無法解讀對方的心意，不妨從他的朋友處著手，或許能找到眉目；經過深思熟慮或採取事前演練的方式是你今日處理事情時必須重視的步驟；因考慮周到，投資上可開創新的局面。', 4, '容易得到異性的主動關心和幫助，讓你很有滿足感，被愛的感覺讓你陶醉。', 3, '注意休息，放鬆緊繃的神經，精神好了才能提升競爭力，才會有更大的進步喔！', 4, '偏財運較旺，但不宜刻意追求，正所謂「有心栽花花不開，無心插柳柳成蔭」！', '2020-04-04 16:00:23', '2020-04-04 16:00:23'),
(21, '2020-04-05', '射手座', 3, '今天感覺很甜蜜，他顯得非常遷就你，還會處處替你著想，不過持續這種甜蜜的最佳方法還是要給對方同樣的禮遇哦！不是十拿九穩的投資不可輕易嘗試，以免造成一著不慎而滿盤皆輸的結果；心情舒暢，連人也精神提振了許多。', 4, '特別在意另一半，所以對方的一點點小失誤都會讓你生氣。這可不好，愛他可不能老是對他生氣！', 4, '有志者事竟成，只要你有目標肯勇於付出，會獲得不錯的回報唷！', 3, '想爭取到更多的進財機會，得多留心市場。', '2020-04-04 16:00:25', '2020-04-04 16:00:25'),
(22, '2020-04-05', '摩羯座', 4, '感性的一天，感情很豐富，很想與戀人有更多的時間相處。主動約對方時常共進晚餐、看電影。外出散心容易在旅途中能交到好朋友，而且能在閒聊中釋放情感，解除苦悶。財運上可以關注有增長潛力的項目，易找到機會。', 4, '有點鑽牛角尖，小心讓另一半受不了，應放寬心才好；單身者與異性接觸機會多！', 4, '運勢佳，求職者機會多，易獲得朋友幫忙，可供選擇的機會多，應有所取捨，別太猶豫。', 3, '金子花在刀口上，不死守，不浪費。', '2020-04-04 16:00:27', '2020-04-04 16:00:27'),
(23, '2020-04-05', '水瓶座', 4, '郎情妾意、天涯咫尺是今天甜蜜戀情的寫照，溫馨與浪漫讓你笑到合不攏嘴。送禮的好日子，要與客戶見面的話，準備一份禮物送給對方，易收到很好的效果。財運上手中的投資可繼續持有，還有上升空間。', 4, '好運站在你這邊，單身者可以鼓起勇氣向心儀的對象表白，容易得到熱烈的回應喔！', 4, '特別能替他人著想，易得到他人的信任，讓你今天的事務能進行得更順利。', 3, '必須小心理財，盡量多儲蓄以備不時之需。', '2020-04-04 16:00:29', '2020-04-04 16:00:29'),
(24, '2020-04-05', '雙魚座', 4, '辛苦了好長一段時間，可趁今日閒暇之時到餐館享受美食，慰勞一下自己；已婚者可利用閒暇時光和伴侶一起在家進行大掃除，將會清出不少可循環利用的廢棄品，既能使家裡變得整潔溫馨，還能將這些廢棄品換取零用錢。', 3, '與戀人有良好溝通的機會。愛情運很不錯，使你心情更加愉快，戀情朝更好的方向邁進。', 4, '容易接觸到有魄力、有風度的成功者，經驗得到了提升，對日後的事業發展很有利！', 4, '錢財寬鬆，可支援兄弟好友，表現愛心，促進友誼。', '2020-04-04 16:00:32', '2020-04-04 16:00:32');

-- --------------------------------------------------------

--
-- 資料表結構 `google_users`
--

CREATE TABLE `google_users` (
  `id` int(10) UNSIGNED NOT NULL,
  `user_id` int(10) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `google_id` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 資料表的匯出資料 `google_users`
--

INSERT INTO `google_users` (`id`, `user_id`, `name`, `email`, `google_id`, `created_at`, `updated_at`) VALUES
(1, 1, '李忠恩', 'chaoen5@gmail.com', '107804822710674720453', '2020-04-03 15:11:53', '2020-04-03 15:11:53');

-- --------------------------------------------------------

--
-- 資料表結構 `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 資料表的匯出資料 `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '2014_10_12_000000_create_users_table', 1),
(2, '2014_10_12_100000_create_password_resets_table', 1),
(3, '2020_04_03_102338_create_google_users_table', 1),
(4, '2020_04_03_142114_create_constellation_fortunes_table', 1);

-- --------------------------------------------------------

--
-- 資料表結構 `password_resets`
--

CREATE TABLE `password_resets` (
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- 資料表結構 `users`
--

CREATE TABLE `users` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `password` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `platform` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'origin',
  `remember_token` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 資料表的匯出資料 `users`
--

INSERT INTO `users` (`id`, `name`, `email`, `password`, `platform`, `remember_token`, `created_at`, `updated_at`) VALUES
(1, '李忠恩', 'chaoen5@gmail.com', NULL, 'google', 'J0CmO2bQQnGMQOo06ijRhrEKI3H4joiC5SokcLxNOs2KA0GclOF1MKD4EsDX', '2020-04-03 15:11:53', '2020-04-03 15:11:53'),
(2, NULL, '123@123', '$2y$10$mdZhoatIQwEWPFw/TgJgd.WGMk35BqEG9b0BS6KEzVgBySp44f7fS', 'origin', '550tjoVF7mwH1tza0uOdIHN1Ij20Xvh2ETxFcPcdib3emzLgUXwkfFzJSSqF', '2020-04-03 15:12:14', '2020-04-03 15:12:14');

--
-- 已匯出資料表的索引
--

--
-- 資料表索引 `constellation_fortunes`
--
ALTER TABLE `constellation_fortunes`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `google_users`
--
ALTER TABLE `google_users`
  ADD PRIMARY KEY (`id`),
  ADD KEY `google_users_email_google_id_index` (`email`,`google_id`);

--
-- 資料表索引 `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `password_resets`
--
ALTER TABLE `password_resets`
  ADD KEY `password_resets_email_index` (`email`);

--
-- 資料表索引 `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `users_email_platform_unique` (`email`,`platform`);

--
-- 在匯出的資料表使用 AUTO_INCREMENT
--

--
-- 使用資料表 AUTO_INCREMENT `constellation_fortunes`
--
ALTER TABLE `constellation_fortunes`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=25;
--
-- 使用資料表 AUTO_INCREMENT `google_users`
--
ALTER TABLE `google_users`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
--
-- 使用資料表 AUTO_INCREMENT `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;
--
-- 使用資料表 AUTO_INCREMENT `users`
--
ALTER TABLE `users`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
